GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: DAC1CON
#define DAC1CON DAC1CON
extern volatile unsigned char           DAC1CON             __at(0x07F);
#ifndef _LIB_BUILD
asm("DAC1CON equ 07Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE                     :3;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC1NSS                :2;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
        unsigned DAC1OE                 :3;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned OE0                    :1;
        unsigned OE1                    :1;
    };
} DAC1CONbits_t;
extern volatile DAC1CONbits_t DAC1CONbits __at(0x07F);
// bitfield macros
#define _DAC1CON_NSS_POSN                                   0x0
#define _DAC1CON_NSS_POSITION                               0x0
#define _DAC1CON_NSS_SIZE                                   0x2
#define _DAC1CON_NSS_LENGTH                                 0x2
#define _DAC1CON_NSS_MASK                                   0x3
#define _DAC1CON_PSS_POSN                                   0x2
#define _DAC1CON_PSS_POSITION                               0x2
#define _DAC1CON_PSS_SIZE                                   0x2
#define _DAC1CON_PSS_LENGTH                                 0x2
#define _DAC1CON_PSS_MASK                                   0xC
#define _DAC1CON_OE_POSN                                    0x4
#define _DAC1CON_OE_POSITION                                0x4
#define _DAC1CON_OE_SIZE                                    0x3
#define _DAC1CON_OE_LENGTH                                  0x3
#define _DAC1CON_OE_MASK                                    0x70
#define _DAC1CON_EN_POSN                                    0x7
#define _DAC1CON_EN_POSITION                                0x7
#define _DAC1CON_EN_SIZE                                    0x1
#define _DAC1CON_EN_LENGTH                                  0x1
#define _DAC1CON_EN_MASK                                    0x80
#define _DAC1CON_DAC1NSS_POSN                               0x0
#define _DAC1CON_DAC1NSS_POSITION                           0x0
#define _DAC1CON_DAC1NSS_SIZE                               0x2
#define _DAC1CON_DAC1NSS_LENGTH                             0x2
#define _DAC1CON_DAC1NSS_MASK                               0x3
#define _DAC1CON_DAC1PSS0_POSN                              0x2
#define _DAC1CON_DAC1PSS0_POSITION                          0x2
#define _DAC1CON_DAC1PSS0_SIZE                              0x1
#define _DAC1CON_DAC1PSS0_LENGTH                            0x1
#define _DAC1CON_DAC1PSS0_MASK                              0x4
#define _DAC1CON_DAC1PSS1_POSN                              0x3
#define _DAC1CON_DAC1PSS1_POSITION                          0x3
#define _DAC1CON_DAC1PSS1_SIZE                              0x1
#define _DAC1CON_DAC1PSS1_LENGTH                            0x1
#define _DAC1CON_DAC1PSS1_MASK                              0x8
#define _DAC1CON_DAC1OE_POSN                                0x4
#define _DAC1CON_DAC1OE_POSITION                            0x4
#define _DAC1CON_DAC1OE_SIZE                                0x3
#define _DAC1CON_DAC1OE_LENGTH                              0x3
#define _DAC1CON_DAC1OE_MASK                                0x70
#define _DAC1CON_DAC1EN_POSN                                0x7
#define _DAC1CON_DAC1EN_POSITION                            0x7
#define _DAC1CON_DAC1EN_SIZE                                0x1
#define _DAC1CON_DAC1EN_LENGTH                              0x1
#define _DAC1CON_DAC1EN_MASK                                0x80
#define _DAC1CON_NSS0_POSN                                  0x0
#define _DAC1CON_NSS0_POSITION                              0x0
#define _DAC1CON_NSS0_SIZE                                  0x1
#define _DAC1CON_NSS0_LENGTH                                0x1
#define _DAC1CON_NSS0_MASK                                  0x1
#define _DAC1CON_PSS0_POSN                                  0x2
#define _DAC1CON_PSS0_POSITION                              0x2
#define _DAC1CON_PSS0_SIZE                                  0x1
#define _DAC1CON_PSS0_LENGTH                                0x1
#define _DAC1CON_PSS0_MASK                                  0x4
#define _DAC1CON_PSS1_POSN                                  0x3
#define _DAC1CON_PSS1_POSITION                              0x3
#define _DAC1CON_PSS1_SIZE                                  0x1
#define _DAC1CON_PSS1_LENGTH                                0x1
#define _DAC1CON_PSS1_MASK                                  0x8
#define _DAC1CON_OE0_POSN                                   0x4
#define _DAC1CON_OE0_POSITION                               0x4
#define _DAC1CON_OE0_SIZE                                   0x1
#define _DAC1CON_OE0_LENGTH                                 0x1
#define _DAC1CON_OE0_MASK                                   0x10
#define _DAC1CON_OE1_POSN                                   0x5
#define _DAC1CON_OE1_POSITION                               0x5
#define _DAC1CON_OE1_SIZE                                   0x1
#define _DAC1CON_OE1_LENGTH                                 0x1
#define _DAC1CON_OE1_MASK                                   0x20

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
extern volatile unsigned char           SPI1RXB             __at(0x080);
#ifndef _LIB_BUILD
asm("SPI1RXB equ 080h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
    struct {
        unsigned RXB0                   :1;
        unsigned RXB1                   :1;
        unsigned RXB2                   :1;
        unsigned RXB3                   :1;
        unsigned RXB4                   :1;
        unsigned RXB5                   :1;
        unsigned RXB6                   :1;
        unsigned RXB7                   :1;
    };
} SPI1RXBbits_t;
extern volatile SPI1RXBbits_t SPI1RXBbits __at(0x080);
// bitfield macros
#define _SPI1RXB_RXB_POSN                                   0x0
#define _SPI1RXB_RXB_POSITION                               0x0
#define _SPI1RXB_RXB_SIZE                                   0x8
#define _SPI1RXB_RXB_LENGTH                                 0x8
#define _SPI1RXB_RXB_MASK                                   0xFF
#define _SPI1RXB_RXB0_POSN                                  0x0
#define _SPI1RXB_RXB0_POSITION                              0x0
#define _SPI1RXB_RXB0_SIZE                                  0x1
#define _SPI1RXB_RXB0_LENGTH                                0x1
#define _SPI1RXB_RXB0_MASK                                  0x1
#define _SPI1RXB_RXB1_POSN                                  0x1
#define _SPI1RXB_RXB1_POSITION                              0x1
#define _SPI1RXB_RXB1_SIZE                                  0x1
#define _SPI1RXB_RXB1_LENGTH                                0x1
#define _SPI1RXB_RXB1_MASK                                  0x2
#define _SPI1RXB_RXB2_POSN                                  0x2
#define _SPI1RXB_RXB2_POSITION                              0x2
#define _SPI1RXB_RXB2_SIZE                                  0x1
#define _SPI1RXB_RXB2_LENGTH                                0x1
#define _SPI1RXB_RXB2_MASK                                  0x4
#define _SPI1RXB_RXB3_POSN                                  0x3
#define _SPI1RXB_RXB3_POSITION                              0x3
#define _SPI1RXB_RXB3_SIZE                                  0x1
#define _SPI1RXB_RXB3_LENGTH                                0x1
#define _SPI1RXB_RXB3_MASK                                  0x8
#define _SPI1RXB_RXB4_POSN                                  0x4
#define _SPI1RXB_RXB4_POSITION                              0x4
#define _SPI1RXB_RXB4_SIZE                                  0x1
#define _SPI1RXB_RXB4_LENGTH                                0x1
#define _SPI1RXB_RXB4_MASK                                  0x10
#define _SPI1RXB_RXB5_POSN                                  0x5
#define _SPI1RXB_RXB5_POSITION                              0x5
#define _SPI1RXB_RXB5_SIZE                                  0x1
#define _SPI1RXB_RXB5_LENGTH                                0x1
#define _SPI1RXB_RXB5_MASK                                  0x20
#define _SPI1RXB_RXB6_POSN                                  0x6
#define _SPI1RXB_RXB6_POSITION                              0x6
#define _SPI1RXB_RXB6_SIZE                                  0x1
#define _SPI1RXB_RXB6_LENGTH                                0x1
#define _SPI1RXB_RXB6_MASK                                  0x40
#define _SPI1RXB_RXB7_POSN                                  0x7
#define _SPI1RXB_RXB7_POSITION                              0x7
#define _SPI1RXB_RXB7_SIZE                                  0x1
#define _SPI1RXB_RXB7_LENGTH                                0x1
#define _SPI1RXB_RXB7_MASK                                  0x80

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
extern volatile unsigned char           SPI1TXB             __at(0x081);
#ifndef _LIB_BUILD
asm("SPI1TXB equ 081h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
    struct {
        unsigned TXB0                   :1;
        unsigned TXB1                   :1;
        unsigned TXB2                   :1;
        unsigned TXB3                   :1;
        unsigned TXB4                   :1;
        unsigned TXB5                   :1;
        unsigned TXB6                   :1;
        unsigned TXB7                   :1;
    };
} SPI1TXBbits_t;
extern volatile SPI1TXBbits_t SPI1TXBbits __at(0x081);
// bitfield macros
#define _SPI1TXB_TXB_POSN                                   0x0
#define _SPI1TXB_TXB_POSITION                               0x0
#define _SPI1TXB_TXB_SIZE                                   0x8
#define _SPI1TXB_TXB_LENGTH                                 0x8
#define _SPI1TXB_TXB_MASK                                   0xFF
#define _SPI1TXB_TXB0_POSN                                  0x0
#define _SPI1TXB_TXB0_POSITION                              0x0
#define _SPI1TXB_TXB0_SIZE                                  0x1
#define _SPI1TXB_TXB0_LENGTH                                0x1
#define _SPI1TXB_TXB0_MASK                                  0x1
#define _SPI1TXB_TXB1_POSN                                  0x1
#define _SPI1TXB_TXB1_POSITION                              0x1
#define _SPI1TXB_TXB1_SIZE                                  0x1
#define _SPI1TXB_TXB1_LENGTH                                0x1
#define _SPI1TXB_TXB1_MASK                                  0x2
#define _SPI1TXB_TXB2_POSN                                  0x2
#define _SPI1TXB_TXB2_POSITION                              0x2
#define _SPI1TXB_TXB2_SIZE                                  0x1
#define _SPI1TXB_TXB2_LENGTH                                0x1
#define _SPI1TXB_TXB2_MASK                                  0x4
#define _SPI1TXB_TXB3_POSN                                  0x3
#define _SPI1TXB_TXB3_POSITION                              0x3
#define _SPI1TXB_TXB3_SIZE                                  0x1
#define _SPI1TXB_TXB3_LENGTH                                0x1
#define _SPI1TXB_TXB3_MASK                                  0x8
#define _SPI1TXB_TXB4_POSN                                  0x4
#define _SPI1TXB_TXB4_POSITION                              0x4
#define _SPI1TXB_TXB4_SIZE                                  0x1
#define _SPI1TXB_TXB4_LENGTH                                0x1
#define _SPI1TXB_TXB4_MASK                                  0x10
#define _SPI1TXB_TXB5_POSN                                  0x5
#define _SPI1TXB_TXB5_POSITION                              0x5
#define _SPI1TXB_TXB5_SIZE                                  0x1
#define _SPI1TXB_TXB5_LENGTH                                0x1
#define _SPI1TXB_TXB5_MASK                                  0x20
#define _SPI1TXB_TXB6_POSN                                  0x6
#define _SPI1TXB_TXB6_POSITION                              0x6
#define _SPI1TXB_TXB6_SIZE                                  0x1
#define _SPI1TXB_TXB6_LENGTH                                0x1
#define _SPI1TXB_TXB6_MASK                                  0x40
#define _SPI1TXB_TXB7_POSN                                  0x7
#define _SPI1TXB_TXB7_POSITION                              0x7
#define _SPI1TXB_TXB7_SIZE                                  0x1
#define _SPI1TXB_TXB7_LENGTH                                0x1
#define _SPI1TXB_TXB7_MASK                                  0x80

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
extern volatile unsigned short          SPI1TCNT            __at(0x082);
#ifndef _LIB_BUILD
asm("SPI1TCNT equ 082h");
#endif

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
extern volatile unsigned char           SPI1TCNTL           __at(0x082);
#ifndef _LIB_BUILD
asm("SPI1TCNTL equ 082h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTL                  :8;
    };
} SPI1TCNTLbits_t;
extern volatile SPI1TCNTLbits_t SPI1TCNTLbits __at(0x082);
// bitfield macros
#define _SPI1TCNTL_TCNTL_POSN                               0x0
#define _SPI1TCNTL_TCNTL_POSITION                           0x0
#define _SPI1TCNTL_TCNTL_SIZE                               0x8
#define _SPI1TCNTL_TCNTL_LENGTH                             0x8
#define _SPI1TCNTL_TCNTL_MASK                               0xFF

