GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: DAC3DATL
#define DAC3DATL DAC3DATL
extern volatile unsigned char           DAC3DATL            __at(0x0C3);
#ifndef _LIB_BUILD
asm("DAC3DATL equ 0C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC3R                  :8;
    };
    struct {
        unsigned DAC3R0                 :1;
        unsigned DAC3R1                 :1;
        unsigned DAC3R2                 :1;
        unsigned DAC3R3                 :1;
        unsigned DAC3R4                 :1;
        unsigned DAC3R5                 :1;
        unsigned DAC3R6                 :1;
        unsigned DAC3R7                 :1;
    };
    struct {
        unsigned DAC3RL                 :8;
    };
} DAC3DATLbits_t;
extern volatile DAC3DATLbits_t DAC3DATLbits __at(0x0C3);
// bitfield macros
#define _DAC3DATL_DAC3R_POSN                                0x0
#define _DAC3DATL_DAC3R_POSITION                            0x0
#define _DAC3DATL_DAC3R_SIZE                                0x8
#define _DAC3DATL_DAC3R_LENGTH                              0x8
#define _DAC3DATL_DAC3R_MASK                                0xFF
#define _DAC3DATL_DAC3R0_POSN                               0x0
#define _DAC3DATL_DAC3R0_POSITION                           0x0
#define _DAC3DATL_DAC3R0_SIZE                               0x1
#define _DAC3DATL_DAC3R0_LENGTH                             0x1
#define _DAC3DATL_DAC3R0_MASK                               0x1
#define _DAC3DATL_DAC3R1_POSN                               0x1
#define _DAC3DATL_DAC3R1_POSITION                           0x1
#define _DAC3DATL_DAC3R1_SIZE                               0x1
#define _DAC3DATL_DAC3R1_LENGTH                             0x1
#define _DAC3DATL_DAC3R1_MASK                               0x2
#define _DAC3DATL_DAC3R2_POSN                               0x2
#define _DAC3DATL_DAC3R2_POSITION                           0x2
#define _DAC3DATL_DAC3R2_SIZE                               0x1
#define _DAC3DATL_DAC3R2_LENGTH                             0x1
#define _DAC3DATL_DAC3R2_MASK                               0x4
#define _DAC3DATL_DAC3R3_POSN                               0x3
#define _DAC3DATL_DAC3R3_POSITION                           0x3
#define _DAC3DATL_DAC3R3_SIZE                               0x1
#define _DAC3DATL_DAC3R3_LENGTH                             0x1
#define _DAC3DATL_DAC3R3_MASK                               0x8
#define _DAC3DATL_DAC3R4_POSN                               0x4
#define _DAC3DATL_DAC3R4_POSITION                           0x4
#define _DAC3DATL_DAC3R4_SIZE                               0x1
#define _DAC3DATL_DAC3R4_LENGTH                             0x1
#define _DAC3DATL_DAC3R4_MASK                               0x10
#define _DAC3DATL_DAC3R5_POSN                               0x5
#define _DAC3DATL_DAC3R5_POSITION                           0x5
#define _DAC3DATL_DAC3R5_SIZE                               0x1
#define _DAC3DATL_DAC3R5_LENGTH                             0x1
#define _DAC3DATL_DAC3R5_MASK                               0x20
#define _DAC3DATL_DAC3R6_POSN                               0x6
#define _DAC3DATL_DAC3R6_POSITION                           0x6
#define _DAC3DATL_DAC3R6_SIZE                               0x1
#define _DAC3DATL_DAC3R6_LENGTH                             0x1
#define _DAC3DATL_DAC3R6_MASK                               0x40
#define _DAC3DATL_DAC3R7_POSN                               0x7
#define _DAC3DATL_DAC3R7_POSITION                           0x7
#define _DAC3DATL_DAC3R7_SIZE                               0x1
#define _DAC3DATL_DAC3R7_LENGTH                             0x1
#define _DAC3DATL_DAC3R7_MASK                               0x80
#define _DAC3DATL_DAC3RL_POSN                               0x0
#define _DAC3DATL_DAC3RL_POSITION                           0x0
#define _DAC3DATL_DAC3RL_SIZE                               0x8
#define _DAC3DATL_DAC3RL_LENGTH                             0x8
#define _DAC3DATL_DAC3RL_MASK                               0xFF

// Register: DAC3CON
#define DAC3CON DAC3CON
extern volatile unsigned char           DAC3CON             __at(0x0C5);
#ifndef _LIB_BUILD
asm("DAC3CON equ 0C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE                     :3;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC3NSS                :2;
        unsigned DAC3PSS0               :1;
        unsigned DAC3PSS1               :1;
        unsigned DAC3OE                 :3;
        unsigned DAC3EN                 :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned OE0                    :1;
        unsigned OE1                    :1;
    };
} DAC3CONbits_t;
extern volatile DAC3CONbits_t DAC3CONbits __at(0x0C5);
// bitfield macros
#define _DAC3CON_NSS_POSN                                   0x0
#define _DAC3CON_NSS_POSITION                               0x0
#define _DAC3CON_NSS_SIZE                                   0x2
#define _DAC3CON_NSS_LENGTH                                 0x2
#define _DAC3CON_NSS_MASK                                   0x3
#define _DAC3CON_PSS_POSN                                   0x2
#define _DAC3CON_PSS_POSITION                               0x2
#define _DAC3CON_PSS_SIZE                                   0x2
#define _DAC3CON_PSS_LENGTH                                 0x2
#define _DAC3CON_PSS_MASK                                   0xC
#define _DAC3CON_OE_POSN                                    0x4
#define _DAC3CON_OE_POSITION                                0x4
#define _DAC3CON_OE_SIZE                                    0x3
#define _DAC3CON_OE_LENGTH                                  0x3
#define _DAC3CON_OE_MASK                                    0x70
#define _DAC3CON_EN_POSN                                    0x7
#define _DAC3CON_EN_POSITION                                0x7
#define _DAC3CON_EN_SIZE                                    0x1
#define _DAC3CON_EN_LENGTH                                  0x1
#define _DAC3CON_EN_MASK                                    0x80
#define _DAC3CON_DAC3NSS_POSN                               0x0
#define _DAC3CON_DAC3NSS_POSITION                           0x0
#define _DAC3CON_DAC3NSS_SIZE                               0x2
#define _DAC3CON_DAC3NSS_LENGTH                             0x2
#define _DAC3CON_DAC3NSS_MASK                               0x3
#define _DAC3CON_DAC3PSS0_POSN                              0x2
#define _DAC3CON_DAC3PSS0_POSITION                          0x2
#define _DAC3CON_DAC3PSS0_SIZE                              0x1
#define _DAC3CON_DAC3PSS0_LENGTH                            0x1
#define _DAC3CON_DAC3PSS0_MASK                              0x4
#define _DAC3CON_DAC3PSS1_POSN                              0x3
#define _DAC3CON_DAC3PSS1_POSITION                          0x3
#define _DAC3CON_DAC3PSS1_SIZE                              0x1
#define _DAC3CON_DAC3PSS1_LENGTH                            0x1
#define _DAC3CON_DAC3PSS1_MASK                              0x8
#define _DAC3CON_DAC3OE_POSN                                0x4
#define _DAC3CON_DAC3OE_POSITION                            0x4
#define _DAC3CON_DAC3OE_SIZE                                0x3
#define _DAC3CON_DAC3OE_LENGTH                              0x3
#define _DAC3CON_DAC3OE_MASK                                0x70
#define _DAC3CON_DAC3EN_POSN                                0x7
#define _DAC3CON_DAC3EN_POSITION                            0x7
#define _DAC3CON_DAC3EN_SIZE                                0x1
#define _DAC3CON_DAC3EN_LENGTH                              0x1
#define _DAC3CON_DAC3EN_MASK                                0x80
#define _DAC3CON_NSS0_POSN                                  0x0
#define _DAC3CON_NSS0_POSITION                              0x0
#define _DAC3CON_NSS0_SIZE                                  0x1
#define _DAC3CON_NSS0_LENGTH                                0x1
#define _DAC3CON_NSS0_MASK                                  0x1
#define _DAC3CON_PSS0_POSN                                  0x2
#define _DAC3CON_PSS0_POSITION                              0x2
#define _DAC3CON_PSS0_SIZE                                  0x1
#define _DAC3CON_PSS0_LENGTH                                0x1
#define _DAC3CON_PSS0_MASK                                  0x4
#define _DAC3CON_PSS1_POSN                                  0x3
#define _DAC3CON_PSS1_POSITION                              0x3
#define _DAC3CON_PSS1_SIZE                                  0x1
#define _DAC3CON_PSS1_LENGTH                                0x1
#define _DAC3CON_PSS1_MASK                                  0x8
#define _DAC3CON_OE0_POSN                                   0x4
#define _DAC3CON_OE0_POSITION                               0x4
#define _DAC3CON_OE0_SIZE                                   0x1
#define _DAC3CON_OE0_LENGTH                                 0x1
#define _DAC3CON_OE0_MASK                                   0x10
#define _DAC3CON_OE1_POSN                                   0x5
#define _DAC3CON_OE1_POSITION                               0x5
#define _DAC3CON_OE1_SIZE                                   0x1
#define _DAC3CON_OE1_LENGTH                                 0x1
#define _DAC3CON_OE1_MASK                                   0x20

// Register: CLCDATA
#define CLCDATA CLCDATA
extern volatile unsigned char           CLCDATA             __at(0x0D4);
#ifndef _LIB_BUILD
asm("CLCDATA equ 0D4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC1OUT                :1;
        unsigned CLC2OUT                :1;
        unsigned CLC3OUT                :1;
        unsigned CLC4OUT                :1;
        unsigned CLC5OUT                :1;
        unsigned CLC6OUT                :1;
        unsigned CLC7OUT                :1;
        unsigned CLC8OUT                :1;
    };
} CLCDATAbits_t;
