GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
extern volatile ADCGDbits_t ADCGDbits __at(0x113);
// bitfield macros
#define _ADCGD_CGD0_POSN                                    0x0
#define _ADCGD_CGD0_POSITION                                0x0
#define _ADCGD_CGD0_SIZE                                    0x1
#define _ADCGD_CGD0_LENGTH                                  0x1
#define _ADCGD_CGD0_MASK                                    0x1
#define _ADCGD_CGD1_POSN                                    0x1
#define _ADCGD_CGD1_POSITION                                0x1
#define _ADCGD_CGD1_SIZE                                    0x1
#define _ADCGD_CGD1_LENGTH                                  0x1
#define _ADCGD_CGD1_MASK                                    0x2
#define _ADCGD_CGD2_POSN                                    0x2
#define _ADCGD_CGD2_POSITION                                0x2
#define _ADCGD_CGD2_SIZE                                    0x1
#define _ADCGD_CGD2_LENGTH                                  0x1
#define _ADCGD_CGD2_MASK                                    0x4
#define _ADCGD_CGD3_POSN                                    0x3
#define _ADCGD_CGD3_POSITION                                0x3
#define _ADCGD_CGD3_SIZE                                    0x1
#define _ADCGD_CGD3_LENGTH                                  0x1
#define _ADCGD_CGD3_MASK                                    0x8
#define _ADCGD_CGD4_POSN                                    0x4
#define _ADCGD_CGD4_POSITION                                0x4
#define _ADCGD_CGD4_SIZE                                    0x1
#define _ADCGD_CGD4_LENGTH                                  0x1
#define _ADCGD_CGD4_MASK                                    0x10
#define _ADCGD_CGD5_POSN                                    0x5
#define _ADCGD_CGD5_POSITION                                0x5
#define _ADCGD_CGD5_SIZE                                    0x1
#define _ADCGD_CGD5_LENGTH                                  0x1
#define _ADCGD_CGD5_MASK                                    0x20
#define _ADCGD_CGD6_POSN                                    0x6
#define _ADCGD_CGD6_POSITION                                0x6
#define _ADCGD_CGD6_SIZE                                    0x1
#define _ADCGD_CGD6_LENGTH                                  0x1
#define _ADCGD_CGD6_MASK                                    0x40
#define _ADCGD_CGD7_POSN                                    0x7
#define _ADCGD_CGD7_POSITION                                0x7
#define _ADCGD_CGD7_SIZE                                    0x1
#define _ADCGD_CGD7_LENGTH                                  0x1
#define _ADCGD_CGD7_MASK                                    0x80
#define _ADCGD_ADCGD0_POSN                                  0x0
#define _ADCGD_ADCGD0_POSITION                              0x0
#define _ADCGD_ADCGD0_SIZE                                  0x1
#define _ADCGD_ADCGD0_LENGTH                                0x1
#define _ADCGD_ADCGD0_MASK                                  0x1
#define _ADCGD_ADCGD1_POSN                                  0x1
#define _ADCGD_ADCGD1_POSITION                              0x1
#define _ADCGD_ADCGD1_SIZE                                  0x1
#define _ADCGD_ADCGD1_LENGTH                                0x1
#define _ADCGD_ADCGD1_MASK                                  0x2
#define _ADCGD_ADCGD2_POSN                                  0x2
#define _ADCGD_ADCGD2_POSITION                              0x2
#define _ADCGD_ADCGD2_SIZE                                  0x1
#define _ADCGD_ADCGD2_LENGTH                                0x1
#define _ADCGD_ADCGD2_MASK                                  0x4
#define _ADCGD_ADCGD3_POSN                                  0x3
#define _ADCGD_ADCGD3_POSITION                              0x3
#define _ADCGD_ADCGD3_SIZE                                  0x1
#define _ADCGD_ADCGD3_LENGTH                                0x1
#define _ADCGD_ADCGD3_MASK                                  0x8
#define _ADCGD_ADCGD4_POSN                                  0x4
#define _ADCGD_ADCGD4_POSITION                              0x4
#define _ADCGD_ADCGD4_SIZE                                  0x1
#define _ADCGD_ADCGD4_LENGTH                                0x1
#define _ADCGD_ADCGD4_MASK                                  0x10
#define _ADCGD_ADCGD5_POSN                                  0x5
#define _ADCGD_ADCGD5_POSITION                              0x5
#define _ADCGD_ADCGD5_SIZE                                  0x1
#define _ADCGD_ADCGD5_LENGTH                                0x1
#define _ADCGD_ADCGD5_MASK                                  0x20
#define _ADCGD_ADCGD6_POSN                                  0x6
#define _ADCGD_ADCGD6_POSITION                              0x6
#define _ADCGD_ADCGD6_SIZE                                  0x1
#define _ADCGD_ADCGD6_LENGTH                                0x1
#define _ADCGD_ADCGD6_MASK                                  0x40
#define _ADCGD_ADCGD7_POSN                                  0x7
#define _ADCGD_ADCGD7_POSITION                              0x7
#define _ADCGD_ADCGD7_SIZE                                  0x1
#define _ADCGD_ADCGD7_LENGTH                                0x1
#define _ADCGD_ADCGD7_MASK                                  0x80

// Register: ADCGE
#define ADCGE ADCGE
extern volatile unsigned char           ADCGE               __at(0x114);
#ifndef _LIB_BUILD
asm("ADCGE equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGE0                   :1;
        unsigned CGE1                   :1;
        unsigned CGE2                   :1;
    };
    struct {
        unsigned ADCGE0                 :1;
        unsigned ADCGE1                 :1;
        unsigned ADCGE2                 :1;
    };
} ADCGEbits_t;
extern volatile ADCGEbits_t ADCGEbits __at(0x114);
// bitfield macros
#define _ADCGE_CGE0_POSN                                    0x0
#define _ADCGE_CGE0_POSITION                                0x0
#define _ADCGE_CGE0_SIZE                                    0x1
#define _ADCGE_CGE0_LENGTH                                  0x1
#define _ADCGE_CGE0_MASK                                    0x1
#define _ADCGE_CGE1_POSN                                    0x1
#define _ADCGE_CGE1_POSITION                                0x1
#define _ADCGE_CGE1_SIZE                                    0x1
#define _ADCGE_CGE1_LENGTH                                  0x1
#define _ADCGE_CGE1_MASK                                    0x2
#define _ADCGE_CGE2_POSN                                    0x2
#define _ADCGE_CGE2_POSITION                                0x2
#define _ADCGE_CGE2_SIZE                                    0x1
#define _ADCGE_CGE2_LENGTH                                  0x1
#define _ADCGE_CGE2_MASK                                    0x4
#define _ADCGE_ADCGE0_POSN                                  0x0
#define _ADCGE_ADCGE0_POSITION                              0x0
#define _ADCGE_ADCGE0_SIZE                                  0x1
#define _ADCGE_ADCGE0_LENGTH                                0x1
#define _ADCGE_ADCGE0_MASK                                  0x1
#define _ADCGE_ADCGE1_POSN                                  0x1
#define _ADCGE_ADCGE1_POSITION                              0x1
#define _ADCGE_ADCGE1_SIZE                                  0x1
#define _ADCGE_ADCGE1_LENGTH                                0x1
#define _ADCGE_ADCGE1_MASK                                  0x2
#define _ADCGE_ADCGE2_POSN                                  0x2
#define _ADCGE_ADCGE2_POSITION                              0x2
#define _ADCGE_ADCGE2_SIZE                                  0x1
#define _ADCGE_ADCGE2_LENGTH                                0x1
#define _ADCGE_ADCGE2_MASK                                  0x4

