GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: APMPERE1H
#define APMPERE1H APMPERE1H
extern volatile unsigned char           APMPERE1H           __at(0x1D2);
#ifndef _LIB_BUILD
asm("APMPERE1H equ 01D2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERE1               :8;
    };
    struct {
        unsigned OPA1                   :1;
        unsigned OPA2                   :1;
        unsigned DAC1                   :1;
        unsigned DAC2                   :1;
        unsigned DAC3                   :1;
        unsigned CMP1                   :1;
        unsigned CMP2                   :1;
        unsigned ZCD                    :1;
    };
    struct {
        unsigned APMPERE1_8             :1;
        unsigned APMPERE1_9             :1;
        unsigned APMPERE1_10            :1;
        unsigned APMPERE1_11            :1;
        unsigned APMPERE1_12            :1;
        unsigned APMPERE1_13            :1;
        unsigned APMPERE1_14            :1;
        unsigned APMPERE1_15            :1;
    };
} APMPERE1Hbits_t;
extern volatile APMPERE1Hbits_t APMPERE1Hbits __at(0x1D2);
// bitfield macros
#define _APMPERE1H_APMPERE1_POSN                            0x0
#define _APMPERE1H_APMPERE1_POSITION                        0x0
#define _APMPERE1H_APMPERE1_SIZE                            0x8
#define _APMPERE1H_APMPERE1_LENGTH                          0x8
#define _APMPERE1H_APMPERE1_MASK                            0xFF
#define _APMPERE1H_OPA1_POSN                                0x0
#define _APMPERE1H_OPA1_POSITION                            0x0
#define _APMPERE1H_OPA1_SIZE                                0x1
#define _APMPERE1H_OPA1_LENGTH                              0x1
#define _APMPERE1H_OPA1_MASK                                0x1
#define _APMPERE1H_OPA2_POSN                                0x1
#define _APMPERE1H_OPA2_POSITION                            0x1
#define _APMPERE1H_OPA2_SIZE                                0x1
#define _APMPERE1H_OPA2_LENGTH                              0x1
#define _APMPERE1H_OPA2_MASK                                0x2
#define _APMPERE1H_DAC1_POSN                                0x2
#define _APMPERE1H_DAC1_POSITION                            0x2
#define _APMPERE1H_DAC1_SIZE                                0x1
#define _APMPERE1H_DAC1_LENGTH                              0x1
#define _APMPERE1H_DAC1_MASK                                0x4
#define _APMPERE1H_DAC2_POSN                                0x3
#define _APMPERE1H_DAC2_POSITION                            0x3
#define _APMPERE1H_DAC2_SIZE                                0x1
#define _APMPERE1H_DAC2_LENGTH                              0x1
#define _APMPERE1H_DAC2_MASK                                0x8
#define _APMPERE1H_DAC3_POSN                                0x4
#define _APMPERE1H_DAC3_POSITION                            0x4
#define _APMPERE1H_DAC3_SIZE                                0x1
#define _APMPERE1H_DAC3_LENGTH                              0x1
#define _APMPERE1H_DAC3_MASK                                0x10
#define _APMPERE1H_CMP1_POSN                                0x5
#define _APMPERE1H_CMP1_POSITION                            0x5
#define _APMPERE1H_CMP1_SIZE                                0x1
#define _APMPERE1H_CMP1_LENGTH                              0x1
#define _APMPERE1H_CMP1_MASK                                0x20
#define _APMPERE1H_CMP2_POSN                                0x6
#define _APMPERE1H_CMP2_POSITION                            0x6
#define _APMPERE1H_CMP2_SIZE                                0x1
#define _APMPERE1H_CMP2_LENGTH                              0x1
#define _APMPERE1H_CMP2_MASK                                0x40
#define _APMPERE1H_ZCD_POSN                                 0x7
#define _APMPERE1H_ZCD_POSITION                             0x7
#define _APMPERE1H_ZCD_SIZE                                 0x1
#define _APMPERE1H_ZCD_LENGTH                               0x1
#define _APMPERE1H_ZCD_MASK                                 0x80
#define _APMPERE1H_APMPERE1_8_POSN                          0x0
#define _APMPERE1H_APMPERE1_8_POSITION                      0x0
#define _APMPERE1H_APMPERE1_8_SIZE                          0x1
#define _APMPERE1H_APMPERE1_8_LENGTH                        0x1
#define _APMPERE1H_APMPERE1_8_MASK                          0x1
#define _APMPERE1H_APMPERE1_9_POSN                          0x1
#define _APMPERE1H_APMPERE1_9_POSITION                      0x1
#define _APMPERE1H_APMPERE1_9_SIZE                          0x1
#define _APMPERE1H_APMPERE1_9_LENGTH                        0x1
#define _APMPERE1H_APMPERE1_9_MASK                          0x2
#define _APMPERE1H_APMPERE1_10_POSN                         0x2
#define _APMPERE1H_APMPERE1_10_POSITION                     0x2
#define _APMPERE1H_APMPERE1_10_SIZE                         0x1
#define _APMPERE1H_APMPERE1_10_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_10_MASK                         0x4
#define _APMPERE1H_APMPERE1_11_POSN                         0x3
#define _APMPERE1H_APMPERE1_11_POSITION                     0x3
#define _APMPERE1H_APMPERE1_11_SIZE                         0x1
#define _APMPERE1H_APMPERE1_11_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_11_MASK                         0x8
#define _APMPERE1H_APMPERE1_12_POSN                         0x4
#define _APMPERE1H_APMPERE1_12_POSITION                     0x4
#define _APMPERE1H_APMPERE1_12_SIZE                         0x1
#define _APMPERE1H_APMPERE1_12_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_12_MASK                         0x10
#define _APMPERE1H_APMPERE1_13_POSN                         0x5
#define _APMPERE1H_APMPERE1_13_POSITION                     0x5
#define _APMPERE1H_APMPERE1_13_SIZE                         0x1
#define _APMPERE1H_APMPERE1_13_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_13_MASK                         0x20
#define _APMPERE1H_APMPERE1_14_POSN                         0x6
#define _APMPERE1H_APMPERE1_14_POSITION                     0x6
#define _APMPERE1H_APMPERE1_14_SIZE                         0x1
#define _APMPERE1H_APMPERE1_14_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_14_MASK                         0x40
#define _APMPERE1H_APMPERE1_15_POSN                         0x7
#define _APMPERE1H_APMPERE1_15_POSITION                     0x7
#define _APMPERE1H_APMPERE1_15_SIZE                         0x1
#define _APMPERE1H_APMPERE1_15_LENGTH                       0x1
#define _APMPERE1H_APMPERE1_15_MASK                         0x80

