GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: ADCSEL1
#define ADCSEL1 ADCSEL1
extern volatile unsigned char           ADCSEL1             __at(0x3FC);
#ifndef _LIB_BUILD
asm("ADCSEL1 equ 03FCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned SSI                    :1;
        unsigned CHEN                   :1;
    };
} ADCSEL1bits_t;
extern volatile ADCSEL1bits_t ADCSEL1bits __at(0x3FC);
// bitfield macros
#define _ADCSEL1_SSI_POSN                                   0x6
#define _ADCSEL1_SSI_POSITION                               0x6
#define _ADCSEL1_SSI_SIZE                                   0x1
#define _ADCSEL1_SSI_LENGTH                                 0x1
#define _ADCSEL1_SSI_MASK                                   0x40
#define _ADCSEL1_CHEN_POSN                                  0x7
#define _ADCSEL1_CHEN_POSITION                              0x7
#define _ADCSEL1_CHEN_SIZE                                  0x1
#define _ADCSEL1_CHEN_LENGTH                                0x1
#define _ADCSEL1_CHEN_MASK                                  0x80

// Register: ADCSEL2
#define ADCSEL2 ADCSEL2
extern volatile unsigned char           ADCSEL2             __at(0x3FD);
#ifndef _LIB_BUILD
asm("ADCSEL2 equ 03FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned SSI                    :1;
        unsigned CHEN                   :1;
    };
} ADCSEL2bits_t;
extern volatile ADCSEL2bits_t ADCSEL2bits __at(0x3FD);
// bitfield macros
#define _ADCSEL2_SSI_POSN                                   0x6
#define _ADCSEL2_SSI_POSITION                               0x6
#define _ADCSEL2_SSI_SIZE                                   0x1
#define _ADCSEL2_SSI_LENGTH                                 0x1
#define _ADCSEL2_SSI_MASK                                   0x40
#define _ADCSEL2_CHEN_POSN                                  0x7
#define _ADCSEL2_CHEN_POSITION                              0x7
#define _ADCSEL2_CHEN_SIZE                                  0x1
#define _ADCSEL2_CHEN_LENGTH                                0x1
#define _ADCSEL2_CHEN_MASK                                  0x80

// Register: ADCSEL3
#define ADCSEL3 ADCSEL3
extern volatile unsigned char           ADCSEL3             __at(0x3FE);
#ifndef _LIB_BUILD
asm("ADCSEL3 equ 03FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned SSI                    :1;
        unsigned CHEN                   :1;
    };
} ADCSEL3bits_t;
extern volatile ADCSEL3bits_t ADCSEL3bits __at(0x3FE);
// bitfield macros
#define _ADCSEL3_SSI_POSN                                   0x6
#define _ADCSEL3_SSI_POSITION                               0x6
#define _ADCSEL3_SSI_SIZE                                   0x1
#define _ADCSEL3_SSI_LENGTH                                 0x1
#define _ADCSEL3_SSI_MASK                                   0x40
#define _ADCSEL3_CHEN_POSN                                  0x7
#define _ADCSEL3_CHEN_POSITION                              0x7
#define _ADCSEL3_CHEN_SIZE                                  0x1
#define _ADCSEL3_CHEN_LENGTH                                0x1
#define _ADCSEL3_CHEN_MASK                                  0x80

// Register: ADCSEL4
#define ADCSEL4 ADCSEL4
extern volatile unsigned char           ADCSEL4             __at(0x3FF);
#ifndef _LIB_BUILD
asm("ADCSEL4 equ 03FFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned SSI                    :1;
        unsigned CHEN                   :1;
    };
} ADCSEL4bits_t;
extern volatile ADCSEL4bits_t ADCSEL4bits __at(0x3FF);
// bitfield macros
#define _ADCSEL4_SSI_POSN                                   0x6
#define _ADCSEL4_SSI_POSITION                               0x6
#define _ADCSEL4_SSI_SIZE                                   0x1
#define _ADCSEL4_SSI_LENGTH                                 0x1
#define _ADCSEL4_SSI_MASK                                   0x40
#define _ADCSEL4_CHEN_POSN                                  0x7
#define _ADCSEL4_CHEN_POSITION                              0x7
#define _ADCSEL4_CHEN_SIZE                                  0x1
#define _ADCSEL4_CHEN_LENGTH                                0x1
#define _ADCSEL4_CHEN_MASK                                  0x80

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x400);
#ifndef _LIB_BUILD
asm("ANSELA equ 0400h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned ANSELA3                :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
        unsigned ANSELA6                :1;
        unsigned ANSELA7                :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x400);
// bitfield macros
#define _ANSELA_ANSELA0_POSN                                0x0
#define _ANSELA_ANSELA0_POSITION                            0x0
#define _ANSELA_ANSELA0_SIZE                                0x1
#define _ANSELA_ANSELA0_LENGTH                              0x1
#define _ANSELA_ANSELA0_MASK                                0x1
#define _ANSELA_ANSELA1_POSN                                0x1
#define _ANSELA_ANSELA1_POSITION                            0x1
#define _ANSELA_ANSELA1_SIZE                                0x1
#define _ANSELA_ANSELA1_LENGTH                              0x1
#define _ANSELA_ANSELA1_MASK                                0x2
#define _ANSELA_ANSELA2_POSN                                0x2
#define _ANSELA_ANSELA2_POSITION                            0x2
#define _ANSELA_ANSELA2_SIZE                                0x1
#define _ANSELA_ANSELA2_LENGTH                              0x1
#define _ANSELA_ANSELA2_MASK                                0x4
#define _ANSELA_ANSELA3_POSN                                0x3
#define _ANSELA_ANSELA3_POSITION                            0x3
#define _ANSELA_ANSELA3_SIZE                                0x1
#define _ANSELA_ANSELA3_LENGTH                              0x1
#define _ANSELA_ANSELA3_MASK                                0x8
#define _ANSELA_ANSELA4_POSN                                0x4
#define _ANSELA_ANSELA4_POSITION                            0x4
#define _ANSELA_ANSELA4_SIZE                                0x1
#define _ANSELA_ANSELA4_LENGTH                              0x1
#define _ANSELA_ANSELA4_MASK                                0x10
#define _ANSELA_ANSELA5_POSN                                0x5
#define _ANSELA_ANSELA5_POSITION                            0x5
#define _ANSELA_ANSELA5_SIZE                                0x1
#define _ANSELA_ANSELA5_LENGTH                              0x1
#define _ANSELA_ANSELA5_MASK                                0x20
#define _ANSELA_ANSELA6_POSN                                0x6
#define _ANSELA_ANSELA6_POSITION                            0x6
#define _ANSELA_ANSELA6_SIZE                                0x1
#define _ANSELA_ANSELA6_LENGTH                              0x1
#define _ANSELA_ANSELA6_MASK                                0x40
#define _ANSELA_ANSELA7_POSN                                0x7
#define _ANSELA_ANSELA7_POSITION                            0x7
#define _ANSELA_ANSELA7_SIZE                                0x1
#define _ANSELA_ANSELA7_LENGTH                              0x1
#define _ANSELA_ANSELA7_MASK                                0x80

