GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0x420);
#ifndef _LIB_BUILD
asm("ANSELE equ 0420h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELE0                :1;
        unsigned ANSELE1                :1;
        unsigned ANSELE2                :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0x420);
// bitfield macros
#define _ANSELE_ANSELE0_POSN                                0x0
#define _ANSELE_ANSELE0_POSITION                            0x0
#define _ANSELE_ANSELE0_SIZE                                0x1
#define _ANSELE_ANSELE0_LENGTH                              0x1
#define _ANSELE_ANSELE0_MASK                                0x1
#define _ANSELE_ANSELE1_POSN                                0x1
#define _ANSELE_ANSELE1_POSITION                            0x1
#define _ANSELE_ANSELE1_SIZE                                0x1
#define _ANSELE_ANSELE1_LENGTH                              0x1
#define _ANSELE_ANSELE1_MASK                                0x2
#define _ANSELE_ANSELE2_POSN                                0x2
#define _ANSELE_ANSELE2_POSITION                            0x2
#define _ANSELE_ANSELE2_SIZE                                0x1
#define _ANSELE_ANSELE2_LENGTH                              0x1
#define _ANSELE_ANSELE2_MASK                                0x4

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0x421);
#ifndef _LIB_BUILD
asm("WPUE equ 0421h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUE0                  :1;
        unsigned WPUE1                  :1;
        unsigned WPUE2                  :1;
        unsigned WPUE3                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0x421);
// bitfield macros
#define _WPUE_WPUE0_POSN                                    0x0
#define _WPUE_WPUE0_POSITION                                0x0
#define _WPUE_WPUE0_SIZE                                    0x1
#define _WPUE_WPUE0_LENGTH                                  0x1
#define _WPUE_WPUE0_MASK                                    0x1
#define _WPUE_WPUE1_POSN                                    0x1
#define _WPUE_WPUE1_POSITION                                0x1
#define _WPUE_WPUE1_SIZE                                    0x1
#define _WPUE_WPUE1_LENGTH                                  0x1
#define _WPUE_WPUE1_MASK                                    0x2
#define _WPUE_WPUE2_POSN                                    0x2
#define _WPUE_WPUE2_POSITION                                0x2
#define _WPUE_WPUE2_SIZE                                    0x1
#define _WPUE_WPUE2_LENGTH                                  0x1
#define _WPUE_WPUE2_MASK                                    0x4
#define _WPUE_WPUE3_POSN                                    0x3
#define _WPUE_WPUE3_POSITION                                0x3
#define _WPUE_WPUE3_SIZE                                    0x1
#define _WPUE_WPUE3_LENGTH                                  0x1
#define _WPUE_WPUE3_MASK                                    0x8

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0x422);
#ifndef _LIB_BUILD
asm("ODCONE equ 0422h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCE0                  :1;
        unsigned ODCE1                  :1;
        unsigned ODCE2                  :1;
    };
} ODCONEbits_t;
extern volatile ODCONEbits_t ODCONEbits __at(0x422);
// bitfield macros
#define _ODCONE_ODCE0_POSN                                  0x0
#define _ODCONE_ODCE0_POSITION                              0x0
#define _ODCONE_ODCE0_SIZE                                  0x1
#define _ODCONE_ODCE0_LENGTH                                0x1
#define _ODCONE_ODCE0_MASK                                  0x1
#define _ODCONE_ODCE1_POSN                                  0x1
#define _ODCONE_ODCE1_POSITION                              0x1
#define _ODCONE_ODCE1_SIZE                                  0x1
#define _ODCONE_ODCE1_LENGTH                                0x1
#define _ODCONE_ODCE1_MASK                                  0x2
#define _ODCONE_ODCE2_POSN                                  0x2
#define _ODCONE_ODCE2_POSITION                              0x2
#define _ODCONE_ODCE2_SIZE                                  0x1
#define _ODCONE_ODCE2_LENGTH                                0x1
#define _ODCONE_ODCE2_MASK                                  0x4

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0x423);
#ifndef _LIB_BUILD
asm("SLRCONE equ 0423h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned SLRE2                  :1;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0x423);
// bitfield macros
#define _SLRCONE_SLRE0_POSN                                 0x0
#define _SLRCONE_SLRE0_POSITION                             0x0
#define _SLRCONE_SLRE0_SIZE                                 0x1
#define _SLRCONE_SLRE0_LENGTH                               0x1
#define _SLRCONE_SLRE0_MASK                                 0x1
#define _SLRCONE_SLRE1_POSN                                 0x1
#define _SLRCONE_SLRE1_POSITION                             0x1
#define _SLRCONE_SLRE1_SIZE                                 0x1
#define _SLRCONE_SLRE1_LENGTH                               0x1
#define _SLRCONE_SLRE1_MASK                                 0x2
#define _SLRCONE_SLRE2_POSN                                 0x2
#define _SLRCONE_SLRE2_POSITION                             0x2
#define _SLRCONE_SLRE2_SIZE                                 0x1
#define _SLRCONE_SLRE2_LENGTH                               0x1
#define _SLRCONE_SLRE2_MASK                                 0x4

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0x424);
#ifndef _LIB_BUILD
asm("INLVLE equ 0424h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned INLVLE2                :1;
        unsigned INLVLE3                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0x424);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x425);
#ifndef _LIB_BUILD
asm("IOCEP equ 0425h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0x425);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x426);
#ifndef _LIB_BUILD
asm("IOCEN equ 0426h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
