GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x4B7);
#ifndef _LIB_BUILD
asm("PIR5 equ 04B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC6IF                 :1;
        unsigned TU16AIF                :1;
        unsigned                        :1;
        unsigned C2IF                   :1;
        unsigned CLC2IF                 :1;
        unsigned PWM2PIF                :1;
        unsigned PWM2IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x4B7);
// bitfield macros
#define _PIR5_CLC6IF_POSN                                   0x1
#define _PIR5_CLC6IF_POSITION                               0x1
#define _PIR5_CLC6IF_SIZE                                   0x1
#define _PIR5_CLC6IF_LENGTH                                 0x1
#define _PIR5_CLC6IF_MASK                                   0x2
#define _PIR5_TU16AIF_POSN                                  0x2
#define _PIR5_TU16AIF_POSITION                              0x2
#define _PIR5_TU16AIF_SIZE                                  0x1
#define _PIR5_TU16AIF_LENGTH                                0x1
#define _PIR5_TU16AIF_MASK                                  0x4
#define _PIR5_C2IF_POSN                                     0x4
#define _PIR5_C2IF_POSITION                                 0x4
#define _PIR5_C2IF_SIZE                                     0x1
#define _PIR5_C2IF_LENGTH                                   0x1
#define _PIR5_C2IF_MASK                                     0x10
#define _PIR5_CLC2IF_POSN                                   0x5
#define _PIR5_CLC2IF_POSITION                               0x5
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x20
#define _PIR5_PWM2PIF_POSN                                  0x6
#define _PIR5_PWM2PIF_POSITION                              0x6
#define _PIR5_PWM2PIF_SIZE                                  0x1
#define _PIR5_PWM2PIF_LENGTH                                0x1
#define _PIR5_PWM2PIF_MASK                                  0x40
#define _PIR5_PWM2IF_POSN                                   0x7
#define _PIR5_PWM2IF_POSITION                               0x7
#define _PIR5_PWM2IF_SIZE                                   0x1
#define _PIR5_PWM2IF_LENGTH                                 0x1
#define _PIR5_PWM2IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x4B8);
#ifndef _LIB_BUILD
asm("PIR6 equ 04B8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IF                 :1;
        unsigned CLC7IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned NCO1IF                 :1;
        unsigned DMA2SCNTIF             :1;
        unsigned DMA2DCNTIF             :1;
        unsigned DMA2ORIF               :1;
        unsigned DMA2AIF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x4B8);
// bitfield macros
#define _PIR6_INT1IF_POSN                                   0x0
#define _PIR6_INT1IF_POSITION                               0x0
#define _PIR6_INT1IF_SIZE                                   0x1
#define _PIR6_INT1IF_LENGTH                                 0x1
#define _PIR6_INT1IF_MASK                                   0x1
#define _PIR6_CLC7IF_POSN                                   0x1
#define _PIR6_CLC7IF_POSITION                               0x1
#define _PIR6_CLC7IF_SIZE                                   0x1
#define _PIR6_CLC7IF_LENGTH                                 0x1
#define _PIR6_CLC7IF_MASK                                   0x2
#define _PIR6_CWG1IF_POSN                                   0x2
#define _PIR6_CWG1IF_POSITION                               0x2
#define _PIR6_CWG1IF_SIZE                                   0x1
#define _PIR6_CWG1IF_LENGTH                                 0x1
#define _PIR6_CWG1IF_MASK                                   0x4
#define _PIR6_NCO1IF_POSN                                   0x3
#define _PIR6_NCO1IF_POSITION                               0x3
#define _PIR6_NCO1IF_SIZE                                   0x1
#define _PIR6_NCO1IF_LENGTH                                 0x1
#define _PIR6_NCO1IF_MASK                                   0x8
#define _PIR6_DMA2SCNTIF_POSN                               0x4
#define _PIR6_DMA2SCNTIF_POSITION                           0x4
#define _PIR6_DMA2SCNTIF_SIZE                               0x1
#define _PIR6_DMA2SCNTIF_LENGTH                             0x1
#define _PIR6_DMA2SCNTIF_MASK                               0x10
#define _PIR6_DMA2DCNTIF_POSN                               0x5
#define _PIR6_DMA2DCNTIF_POSITION                           0x5
#define _PIR6_DMA2DCNTIF_SIZE                               0x1
#define _PIR6_DMA2DCNTIF_LENGTH                             0x1
#define _PIR6_DMA2DCNTIF_MASK                               0x20
#define _PIR6_DMA2ORIF_POSN                                 0x6
#define _PIR6_DMA2ORIF_POSITION                             0x6
#define _PIR6_DMA2ORIF_SIZE                                 0x1
#define _PIR6_DMA2ORIF_LENGTH                               0x1
#define _PIR6_DMA2ORIF_MASK                                 0x40
#define _PIR6_DMA2AIF_POSN                                  0x7
#define _PIR6_DMA2AIF_POSITION                              0x7
#define _PIR6_DMA2AIF_SIZE                                  0x1
#define _PIR6_DMA2AIF_LENGTH                                0x1
#define _PIR6_DMA2AIF_MASK                                  0x80

// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x4B9);
#ifndef _LIB_BUILD
asm("PIR7 equ 04B9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIF               :1;
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
        unsigned                        :1;
        unsigned CLC3IF                 :1;
        unsigned PWM3PIF                :1;
        unsigned PWM3IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x4B9);
// bitfield macros
#define _PIR7_I2C1RXIF_POSN                                 0x0
#define _PIR7_I2C1RXIF_POSITION                             0x0
#define _PIR7_I2C1RXIF_SIZE                                 0x1
#define _PIR7_I2C1RXIF_LENGTH                               0x1
#define _PIR7_I2C1RXIF_MASK                                 0x1
#define _PIR7_I2C1TXIF_POSN                                 0x1
#define _PIR7_I2C1TXIF_POSITION                             0x1
#define _PIR7_I2C1TXIF_SIZE                                 0x1
#define _PIR7_I2C1TXIF_LENGTH                               0x1
#define _PIR7_I2C1TXIF_MASK                                 0x2
#define _PIR7_I2C1IF_POSN                                   0x2
#define _PIR7_I2C1IF_POSITION                               0x2
#define _PIR7_I2C1IF_SIZE                                   0x1
#define _PIR7_I2C1IF_LENGTH                                 0x1
#define _PIR7_I2C1IF_MASK                                   0x4
#define _PIR7_I2C1EIF_POSN                                  0x3
#define _PIR7_I2C1EIF_POSITION                              0x3
#define _PIR7_I2C1EIF_SIZE                                  0x1
#define _PIR7_I2C1EIF_LENGTH                                0x1
#define _PIR7_I2C1EIF_MASK                                  0x8
#define _PIR7_CLC3IF_POSN                                   0x5
#define _PIR7_CLC3IF_POSITION                               0x5
#define _PIR7_CLC3IF_SIZE                                   0x1
#define _PIR7_CLC3IF_LENGTH                                 0x1
#define _PIR7_CLC3IF_MASK                                   0x20
#define _PIR7_PWM3PIF_POSN                                  0x6
#define _PIR7_PWM3PIF_POSITION                              0x6
#define _PIR7_PWM3PIF_SIZE                                  0x1
#define _PIR7_PWM3PIF_LENGTH                                0x1
#define _PIR7_PWM3PIF_MASK                                  0x40
#define _PIR7_PWM3IF_POSN                                   0x7
#define _PIR7_PWM3IF_POSITION                               0x7
#define _PIR7_PWM3IF_SIZE                                   0x1
#define _PIR7_PWM3IF_LENGTH                                 0x1
#define _PIR7_PWM3IF_MASK                                   0x80

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x4BA);
#ifndef _LIB_BUILD
asm("PIR8 equ 04BAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2EIF                  :1;
        unsigned U2IF                   :1;
        unsigned                        :1;
        unsigned CLC4IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned SCANIF                 :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x4BA);
// bitfield macros
#define _PIR8_U2RXIF_POSN                                   0x0
#define _PIR8_U2RXIF_POSITION                               0x0
#define _PIR8_U2RXIF_SIZE                                   0x1
#define _PIR8_U2RXIF_LENGTH                                 0x1
#define _PIR8_U2RXIF_MASK                                   0x1
#define _PIR8_U2TXIF_POSN                                   0x1
#define _PIR8_U2TXIF_POSITION                               0x1
#define _PIR8_U2TXIF_SIZE                                   0x1
#define _PIR8_U2TXIF_LENGTH                                 0x1
#define _PIR8_U2TXIF_MASK                                   0x2
#define _PIR8_U2EIF_POSN                                    0x2
#define _PIR8_U2EIF_POSITION                                0x2
#define _PIR8_U2EIF_SIZE                                    0x1
#define _PIR8_U2EIF_LENGTH                                  0x1
#define _PIR8_U2EIF_MASK                                    0x4
#define _PIR8_U2IF_POSN                                     0x3
#define _PIR8_U2IF_POSITION                                 0x3
#define _PIR8_U2IF_SIZE                                     0x1
#define _PIR8_U2IF_LENGTH                                   0x1
#define _PIR8_U2IF_MASK                                     0x8
#define _PIR8_CLC4IF_POSN                                   0x5
#define _PIR8_CLC4IF_POSITION                               0x5
#define _PIR8_CLC4IF_SIZE                                   0x1
#define _PIR8_CLC4IF_LENGTH                                 0x1
#define _PIR8_CLC4IF_MASK                                   0x20
#define _PIR8_CCP2IF_POSN                                   0x6
#define _PIR8_CCP2IF_POSITION                               0x6
#define _PIR8_CCP2IF_SIZE                                   0x1
#define _PIR8_CCP2IF_LENGTH                                 0x1
#define _PIR8_CCP2IF_MASK                                   0x40
#define _PIR8_SCANIF_POSN                                   0x7
#define _PIR8_SCANIF_POSITION                               0x7
#define _PIR8_SCANIF_SIZE                                   0x1
#define _PIR8_SCANIF_LENGTH                                 0x1
#define _PIR8_SCANIF_MASK                                   0x80

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x4BB);
#ifndef _LIB_BUILD
asm("PIR9 equ 04BBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned DMA3SCNTIF             :1;
        unsigned DMA3DCNTIF             :1;
        unsigned DMA3ORIF               :1;
        unsigned DMA3AIF                :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x4BB);
// bitfield macros
#define _PIR9_DMA3SCNTIF_POSN                               0x4
#define _PIR9_DMA3SCNTIF_POSITION                           0x4
#define _PIR9_DMA3SCNTIF_SIZE                               0x1
#define _PIR9_DMA3SCNTIF_LENGTH                             0x1
#define _PIR9_DMA3SCNTIF_MASK                               0x10
#define _PIR9_DMA3DCNTIF_POSN                               0x5
#define _PIR9_DMA3DCNTIF_POSITION                           0x5
#define _PIR9_DMA3DCNTIF_SIZE                               0x1
#define _PIR9_DMA3DCNTIF_LENGTH                             0x1
#define _PIR9_DMA3DCNTIF_MASK                               0x20
#define _PIR9_DMA3ORIF_POSN                                 0x6
#define _PIR9_DMA3ORIF_POSITION                             0x6
#define _PIR9_DMA3ORIF_SIZE                                 0x1
#define _PIR9_DMA3ORIF_LENGTH                               0x1
#define _PIR9_DMA3ORIF_MASK                                 0x40
#define _PIR9_DMA3AIF_POSN                                  0x7
#define _PIR9_DMA3AIF_POSITION                              0x7
#define _PIR9_DMA3AIF_SIZE                                  0x1
#define _PIR9_DMA3AIF_LENGTH                                0x1
#define _PIR9_DMA3AIF_MASK                                  0x80

// Register: PIR10
#define PIR10 PIR10
extern volatile unsigned char           PIR10               __at(0x4BC);
#ifndef _LIB_BUILD
asm("PIR10 equ 04BCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IF                 :1;
        unsigned CLC8IF                 :1;
        unsigned TU16BIF                :1;
        unsigned TMR4IF                 :1;
        unsigned DMA4SCNTIF             :1;
        unsigned DMA4DCNTIF             :1;
        unsigned DMA4ORIF               :1;
        unsigned DMA4AIF                :1;
    };
} PIR10bits_t;
extern volatile PIR10bits_t PIR10bits __at(0x4BC);
// bitfield macros
#define _PIR10_INT2IF_POSN                                  0x0
#define _PIR10_INT2IF_POSITION                              0x0
#define _PIR10_INT2IF_SIZE                                  0x1
#define _PIR10_INT2IF_LENGTH                                0x1
#define _PIR10_INT2IF_MASK                                  0x1
#define _PIR10_CLC8IF_POSN                                  0x1
#define _PIR10_CLC8IF_POSITION                              0x1
#define _PIR10_CLC8IF_SIZE                                  0x1
#define _PIR10_CLC8IF_LENGTH                                0x1
#define _PIR10_CLC8IF_MASK                                  0x2
#define _PIR10_TU16BIF_POSN                                 0x2
#define _PIR10_TU16BIF_POSITION                             0x2
#define _PIR10_TU16BIF_SIZE                                 0x1
#define _PIR10_TU16BIF_LENGTH                               0x1
#define _PIR10_TU16BIF_MASK                                 0x4
#define _PIR10_TMR4IF_POSN                                  0x3
#define _PIR10_TMR4IF_POSITION                              0x3
#define _PIR10_TMR4IF_SIZE                                  0x1
#define _PIR10_TMR4IF_LENGTH                                0x1
#define _PIR10_TMR4IF_MASK                                  0x8
#define _PIR10_DMA4SCNTIF_POSN                              0x4
#define _PIR10_DMA4SCNTIF_POSITION                          0x4
#define _PIR10_DMA4SCNTIF_SIZE                              0x1
#define _PIR10_DMA4SCNTIF_LENGTH                            0x1
#define _PIR10_DMA4SCNTIF_MASK                              0x10
#define _PIR10_DMA4DCNTIF_POSN                              0x5
#define _PIR10_DMA4DCNTIF_POSITION                          0x5
#define _PIR10_DMA4DCNTIF_SIZE                              0x1
#define _PIR10_DMA4DCNTIF_LENGTH                            0x1
#define _PIR10_DMA4DCNTIF_MASK                              0x20
#define _PIR10_DMA4ORIF_POSN                                0x6
#define _PIR10_DMA4ORIF_POSITION                            0x6
#define _PIR10_DMA4ORIF_SIZE                                0x1
#define _PIR10_DMA4ORIF_LENGTH                              0x1
#define _PIR10_DMA4ORIF_MASK                                0x40
#define _PIR10_DMA4AIF_POSN                                 0x7
#define _PIR10_DMA4AIF_POSITION                             0x7
#define _PIR10_DMA4AIF_SIZE                                 0x1
#define _PIR10_DMA4AIF_LENGTH                               0x1
#define _PIR10_DMA4AIF_MASK                                 0x80

// Register: INTCON0
#define INTCON0 INTCON0
extern volatile unsigned char           INTCON0             __at(0x4D6);
#ifndef _LIB_BUILD
asm("INTCON0 equ 04D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0EDG                :1;
        unsigned INT1EDG                :1;
        unsigned INT2EDG                :1;
        unsigned                        :2;
        unsigned IPEN                   :1;
        unsigned GIEL                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned GIEH                   :1;
    };
} INTCON0bits_t;
