GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
#define                                 BTOC3_bit           _BIT_ACCESS(I2C1BTOC,3)
// I2C1ERR<BTOIE>
extern volatile __bit                   BTOIE               __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTOIE_bit           _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTOIF>
extern volatile __bit                   BTOIF               __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTOIF_bit           _BIT_ACCESS(I2C1ERR,6)
// DMAnBUF<BUF0>
extern volatile __bit                   BUF0                __at(0x748);	// @ (0xE9 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(DMAnBUF,0)
// DMAnBUF<BUF1>
extern volatile __bit                   BUF1                __at(0x749);	// @ (0xE9 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(DMAnBUF,1)
// DMAnBUF<BUF2>
extern volatile __bit                   BUF2                __at(0x74A);	// @ (0xE9 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(DMAnBUF,2)
// DMAnBUF<BUF3>
extern volatile __bit                   BUF3                __at(0x74B);	// @ (0xE9 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(DMAnBUF,3)
// DMAnBUF<BUF4>
extern volatile __bit                   BUF4                __at(0x74C);	// @ (0xE9 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(DMAnBUF,4)
// DMAnBUF<BUF5>
extern volatile __bit                   BUF5                __at(0x74D);	// @ (0xE9 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(DMAnBUF,5)
// DMAnBUF<BUF6>
extern volatile __bit                   BUF6                __at(0x74E);	// @ (0xE9 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(DMAnBUF,6)
// DMAnBUF<BUF7>
extern volatile __bit                   BUF7                __at(0x74F);	// @ (0xE9 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(DMAnBUF,7)
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x1B01);	// @ (0x360 * 8 + 1)
#define                                 BURSTMD_bit         _BIT_ACCESS(SCANCON0,1)
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0x1563);	// @ (0x2AC * 8 + 3)
#define                                 C0EN_bit            _BIT_ACCESS(U1CON2,3)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x387);	// @ (0x70 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x381);	// @ (0x70 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// CM1CON0<C1HYS1>
extern volatile __bit                   C1HYS1              __at(0x382);	// @ (0x70 * 8 + 2)
#define                                 C1HYS1_bit          _BIT_ACCESS(CM1CON0,2)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x2544);	// @ (0x4A8 * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x259C);	// @ (0x4B3 * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x388);	// @ (0x71 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x389);	// @ (0x71 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR1<C1IP>
extern volatile __bit                   C1IP                __at(0x24EC);	// @ (0x49D * 8 + 4)
#define                                 C1IP_bit            _BIT_ACCESS(IPR1,4)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x390);	// @ (0x72 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x391);	// @ (0x72 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x392);	// @ (0x72 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x385);	// @ (0x70 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x386);	// @ (0x70 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x398);	// @ (0x73 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x399);	// @ (0x73 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x39A);	// @ (0x73 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x384);	// @ (0x70 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON1<C1RDY>
extern volatile __bit                   C1RDY               __at(0x38F);	// @ (0x71 * 8 + 7)
#define                                 C1RDY_bit           _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1SP0>
extern volatile __bit                   C1SP0               __at(0x38A);	// @ (0x71 * 8 + 2)
#define                                 C1SP0_bit           _BIT_ACCESS(CM1CON1,2)
// CM1CON1<C1SP1>
extern volatile __bit                   C1SP1               __at(0x38B);	// @ (0x71 * 8 + 3)
#define                                 C1SP1_bit           _BIT_ACCESS(CM1CON1,3)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x380);	// @ (0x70 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x1A60);	// @ (0x34C * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x1A61);	// @ (0x34C * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x3A7);	// @ (0x74 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x3A1);	// @ (0x74 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// CM2CON0<C2HYS1>
extern volatile __bit                   C2HYS1              __at(0x3A2);	// @ (0x74 * 8 + 2)
#define                                 C2HYS1_bit          _BIT_ACCESS(CM2CON0,2)
// PIE5<C2IE>
extern volatile __bit                   C2IE                __at(0x2564);	// @ (0x4AC * 8 + 4)
#define                                 C2IE_bit            _BIT_ACCESS(PIE5,4)
// PIR5<C2IF>
extern volatile __bit                   C2IF                __at(0x25BC);	// @ (0x4B7 * 8 + 4)
#define                                 C2IF_bit            _BIT_ACCESS(PIR5,4)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x3A8);	// @ (0x75 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x3A9);	// @ (0x75 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR5<C2IP>
extern volatile __bit                   C2IP                __at(0x250C);	// @ (0x4A1 * 8 + 4)
#define                                 C2IP_bit            _BIT_ACCESS(IPR5,4)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x3B0);	// @ (0x76 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x3B1);	// @ (0x76 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x3B2);	// @ (0x76 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x3A5);	// @ (0x74 * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x3A6);	// @ (0x74 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x3B8);	// @ (0x77 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x3B9);	// @ (0x77 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x3BA);	// @ (0x77 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x3A4);	// @ (0x74 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON1<C2RDY>
extern volatile __bit                   C2RDY               __at(0x3AF);	// @ (0x75 * 8 + 7)
#define                                 C2RDY_bit           _BIT_ACCESS(CM2CON1,7)
// CM2CON1<C2SP0>
extern volatile __bit                   C2SP0               __at(0x3AA);	// @ (0x75 * 8 + 2)
#define                                 C2SP0_bit           _BIT_ACCESS(CM2CON1,2)
// CM2CON1<C2SP1>
extern volatile __bit                   C2SP1               __at(0x3AB);	// @ (0x75 * 8 + 3)
#define                                 C2SP1_bit           _BIT_ACCESS(CM2CON1,3)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x3A0);	// @ (0x74 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x1A62);	// @ (0x34C * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x1A63);	// @ (0x34C * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1FB4);	// @ (0x3F6 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1FB5);	// @ (0x3F6 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1FB6);	// @ (0x3F6 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1A18);	// @ (0x343 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1A19);	// @ (0x343 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1A1A);	// @ (0x343 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x1A1B);	// @ (0x343 * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1A17);	// @ (0x342 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1A14);	// @ (0x342 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x2556);	// @ (0x4AA * 8 + 6)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x25AE);	// @ (0x4B5 * 8 + 6)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,6)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x24FE);	// @ (0x49F * 8 + 6)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,6)
// PMD2<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x327);	// @ (0x64 * 8 + 7)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD2,7)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1A10);	// @ (0x342 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1A11);	// @ (0x342 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1A12);	// @ (0x342 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1A13);	// @ (0x342 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1A15);	// @ (0x342 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x1278);	// @ (0x24F * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x1279);	// @ (0x24F * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x127A);	// @ (0x24F * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x127B);	// @ (0x24F * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x127C);	// @ (0x24F * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0x127D);	// @ (0x24F * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1A38);	// @ (0x347 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1A39);	// @ (0x347 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1A3A);	// @ (0x347 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x1A3B);	// @ (0x347 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1A37);	// @ (0x346 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1A34);	// @ (0x346 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE8<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x257E);	// @ (0x4AF * 8 + 6)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x25D6);	// @ (0x4BA * 8 + 6)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR8,6)
// IPR8<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x2526);	// @ (0x4A4 * 8 + 6)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR8,6)
// PMD6<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x347);	// @ (0x68 * 8 + 7)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD6,7)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1A30);	// @ (0x346 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1A31);	// @ (0x346 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1A32);	// @ (0x346 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1A33);	// @ (0x346 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1A35);	// @ (0x346 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x1280);	// @ (0x250 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x1281);	// @ (0x250 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x1282);	// @ (0x250 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x1283);	// @ (0x250 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x1284);	// @ (0x250 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0x1285);	// @ (0x250 * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1EBA);	// @ (0x3D7 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1EBB);	// @ (0x3D7 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x570);	// @ (0xAE * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x571);	// @ (0xAE * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x572);	// @ (0xAE * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x573);	// @ (0xAE * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// ADCGA<CGA0>
extern volatile __bit                   CGA0                __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCGA,0)
// ADCGA<CGA1>
extern volatile __bit                   CGA1                __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCGA,1)
// ADCGA<CGA2>
extern volatile __bit                   CGA2                __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCGA,2)
// ADCGA<CGA3>
extern volatile __bit                   CGA3                __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 CGA3_bit            _BIT_ACCESS(ADCGA,3)
// ADCGA<CGA4>
extern volatile __bit                   CGA4                __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCGA,4)
// ADCGA<CGA5>
extern volatile __bit                   CGA5                __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCGA,5)
// ADCGA<CGA6>
extern volatile __bit                   CGA6                __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 CGA6_bit            _BIT_ACCESS(ADCGA,6)
// ADCGA<CGA7>
extern volatile __bit                   CGA7                __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 CGA7_bit            _BIT_ACCESS(ADCGA,7)
// ADCGB<CGB0>
extern volatile __bit                   CGB0                __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 CGB0_bit            _BIT_ACCESS(ADCGB,0)
// ADCGB<CGB1>
extern volatile __bit                   CGB1                __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 CGB1_bit            _BIT_ACCESS(ADCGB,1)
// ADCGB<CGB2>
extern volatile __bit                   CGB2                __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 CGB2_bit            _BIT_ACCESS(ADCGB,2)
// ADCGB<CGB3>
extern volatile __bit                   CGB3                __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 CGB3_bit            _BIT_ACCESS(ADCGB,3)
// ADCGB<CGB4>
extern volatile __bit                   CGB4                __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 CGB4_bit            _BIT_ACCESS(ADCGB,4)
// ADCGB<CGB5>
extern volatile __bit                   CGB5                __at(0x88D);	// @ (0x111 * 8 + 5)
