GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.h
#define                                 OPA2GSEL0_bit       _BIT_ACCESS(OPA2CON1,4)
// OPA2CON1<OPA2GSEL1>
extern volatile __bit                   OPA2GSEL1           __at(0x945);	// @ (0x128 * 8 + 5)
#define                                 OPA2GSEL1_bit       _BIT_ACCESS(OPA2CON1,5)
// OPA2CON1<OPA2GSEL2>
extern volatile __bit                   OPA2GSEL2           __at(0x946);	// @ (0x128 * 8 + 6)
#define                                 OPA2GSEL2_bit       _BIT_ACCESS(OPA2CON1,6)
// OPA2HWC<OPA2HWCH0>
extern volatile __bit                   OPA2HWCH0           __at(0x964);	// @ (0x12C * 8 + 4)
#define                                 OPA2HWCH0_bit       _BIT_ACCESS(OPA2HWC,4)
// OPA2HWC<OPA2HWCH1>
extern volatile __bit                   OPA2HWCH1           __at(0x965);	// @ (0x12C * 8 + 5)
#define                                 OPA2HWCH1_bit       _BIT_ACCESS(OPA2HWC,5)
// OPA2HWC<OPA2HWCH2>
extern volatile __bit                   OPA2HWCH2           __at(0x966);	// @ (0x12C * 8 + 6)
#define                                 OPA2HWCH2_bit       _BIT_ACCESS(OPA2HWC,6)
// OPA2HWC<OPA2HWCL0>
extern volatile __bit                   OPA2HWCL0           __at(0x960);	// @ (0x12C * 8 + 0)
#define                                 OPA2HWCL0_bit       _BIT_ACCESS(OPA2HWC,0)
// OPA2HWC<OPA2HWCL1>
extern volatile __bit                   OPA2HWCL1           __at(0x961);	// @ (0x12C * 8 + 1)
#define                                 OPA2HWCL1_bit       _BIT_ACCESS(OPA2HWC,1)
// OPA2HWC<OPA2HWCL2>
extern volatile __bit                   OPA2HWCL2           __at(0x962);	// @ (0x12C * 8 + 2)
#define                                 OPA2HWCL2_bit       _BIT_ACCESS(OPA2HWC,2)
// OPA2CON3<OPA2INTOE>
extern volatile __bit                   OPA2INTOE           __at(0x955);	// @ (0x12A * 8 + 5)
#define                                 OPA2INTOE_bit       _BIT_ACCESS(OPA2CON3,5)
// PMD5<OPA2MD>
extern volatile __bit                   OPA2MD              __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 OPA2MD_bit          _BIT_ACCESS(PMD5,3)
// OPA2CON2<OPA2NCH0>
extern volatile __bit                   OPA2NCH0            __at(0x94C);	// @ (0x129 * 8 + 4)
#define                                 OPA2NCH0_bit        _BIT_ACCESS(OPA2CON2,4)
// OPA2CON2<OPA2NCH1>
extern volatile __bit                   OPA2NCH1            __at(0x94D);	// @ (0x129 * 8 + 5)
#define                                 OPA2NCH1_bit        _BIT_ACCESS(OPA2CON2,5)
// OPA2CON2<OPA2NCH2>
extern volatile __bit                   OPA2NCH2            __at(0x94E);	// @ (0x129 * 8 + 6)
#define                                 OPA2NCH2_bit        _BIT_ACCESS(OPA2CON2,6)
// OPA2CON1<OPA2NSS0>
extern volatile __bit                   OPA2NSS0            __at(0x940);	// @ (0x128 * 8 + 0)
#define                                 OPA2NSS0_bit        _BIT_ACCESS(OPA2CON1,0)
// OPA2CON1<OPA2NSS1>
extern volatile __bit                   OPA2NSS1            __at(0x941);	// @ (0x128 * 8 + 1)
#define                                 OPA2NSS1_bit        _BIT_ACCESS(OPA2CON1,1)
// OPA2CON1<OPA2NSS2>
extern volatile __bit                   OPA2NSS2            __at(0x942);	// @ (0x128 * 8 + 2)
#define                                 OPA2NSS2_bit        _BIT_ACCESS(OPA2CON1,2)
// OPA2CON4<OPA2OFCSEL0>
extern volatile __bit                   OPA2OFCSEL0         __at(0x958);	// @ (0x12B * 8 + 0)
#define                                 OPA2OFCSEL0_bit     _BIT_ACCESS(OPA2CON4,0)
// OPA2CON4<OPA2OFCSEL1>
extern volatile __bit                   OPA2OFCSEL1         __at(0x959);	// @ (0x12B * 8 + 1)
#define                                 OPA2OFCSEL1_bit     _BIT_ACCESS(OPA2CON4,1)
// OPA2CON4<OPA2OFCST>
extern volatile __bit                   OPA2OFCST           __at(0x95A);	// @ (0x12B * 8 + 2)
#define                                 OPA2OFCST_bit       _BIT_ACCESS(OPA2CON4,2)
// OPA2OFFSET<OPA2OFFSET0>
extern volatile __bit                   OPA2OFFSET0         __at(0x968);	// @ (0x12D * 8 + 0)
#define                                 OPA2OFFSET0_bit     _BIT_ACCESS(OPA2OFFSET,0)
// OPA2OFFSET<OPA2OFFSET1>
extern volatile __bit                   OPA2OFFSET1         __at(0x969);	// @ (0x12D * 8 + 1)
#define                                 OPA2OFFSET1_bit     _BIT_ACCESS(OPA2OFFSET,1)
// OPA2OFFSET<OPA2OFFSET2>
extern volatile __bit                   OPA2OFFSET2         __at(0x96A);	// @ (0x12D * 8 + 2)
#define                                 OPA2OFFSET2_bit     _BIT_ACCESS(OPA2OFFSET,2)
// OPA2OFFSET<OPA2OFFSET3>
extern volatile __bit                   OPA2OFFSET3         __at(0x96B);	// @ (0x12D * 8 + 3)
#define                                 OPA2OFFSET3_bit     _BIT_ACCESS(OPA2OFFSET,3)
// OPA2OFFSET<OPA2OFFSET4>
extern volatile __bit                   OPA2OFFSET4         __at(0x96C);	// @ (0x12D * 8 + 4)
#define                                 OPA2OFFSET4_bit     _BIT_ACCESS(OPA2OFFSET,4)
// OPA2OFFSET<OPA2OFFSET5>
extern volatile __bit                   OPA2OFFSET5         __at(0x96D);	// @ (0x12D * 8 + 5)
#define                                 OPA2OFFSET5_bit     _BIT_ACCESS(OPA2OFFSET,5)
// OPA2OFFSET<OPA2OFFSET6>
extern volatile __bit                   OPA2OFFSET6         __at(0x96E);	// @ (0x12D * 8 + 6)
#define                                 OPA2OFFSET6_bit     _BIT_ACCESS(OPA2OFFSET,6)
// OPA2OFFSET<OPA2OFFSET7>
extern volatile __bit                   OPA2OFFSET7         __at(0x96F);	// @ (0x12D * 8 + 7)
#define                                 OPA2OFFSET7_bit     _BIT_ACCESS(OPA2OFFSET,7)
// OPA2HWC<OPA2OREN>
extern volatile __bit                   OPA2OREN            __at(0x967);	// @ (0x12C * 8 + 7)
#define                                 OPA2OREN_bit        _BIT_ACCESS(OPA2HWC,7)
// OPA2HWC<OPA2ORPOL>
extern volatile __bit                   OPA2ORPOL           __at(0x963);	// @ (0x12C * 8 + 3)
#define                                 OPA2ORPOL_bit       _BIT_ACCESS(OPA2HWC,3)
// OPA2ORS<OPA2ORS0>
extern volatile __bit                   OPA2ORS0            __at(0x970);	// @ (0x12E * 8 + 0)
#define                                 OPA2ORS0_bit        _BIT_ACCESS(OPA2ORS,0)
// OPA2ORS<OPA2ORS1>
extern volatile __bit                   OPA2ORS1            __at(0x971);	// @ (0x12E * 8 + 1)
#define                                 OPA2ORS1_bit        _BIT_ACCESS(OPA2ORS,1)
// OPA2ORS<OPA2ORS2>
extern volatile __bit                   OPA2ORS2            __at(0x972);	// @ (0x12E * 8 + 2)
#define                                 OPA2ORS2_bit        _BIT_ACCESS(OPA2ORS,2)
// OPA2ORS<OPA2ORS3>
extern volatile __bit                   OPA2ORS3            __at(0x973);	// @ (0x12E * 8 + 3)
#define                                 OPA2ORS3_bit        _BIT_ACCESS(OPA2ORS,3)
// OPA2ORS<OPA2ORS4>
extern volatile __bit                   OPA2ORS4            __at(0x974);	// @ (0x12E * 8 + 4)
#define                                 OPA2ORS4_bit        _BIT_ACCESS(OPA2ORS,4)
// OPA2CON2<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x948);	// @ (0x129 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON2,0)
// OPA2CON2<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x949);	// @ (0x129 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON2,1)
// OPA2CON2<OPA2PCH2>
extern volatile __bit                   OPA2PCH2            __at(0x94A);	// @ (0x129 * 8 + 2)
#define                                 OPA2PCH2_bit        _BIT_ACCESS(OPA2CON2,2)
// OPA2ORPPS<OPA2PPS0>
extern volatile __bit                   OPA2PPS0            __at(0x13B8);	// @ (0x277 * 8 + 0)
#define                                 OPA2PPS0_bit        _BIT_ACCESS(OPA2ORPPS,0)
// OPA2ORPPS<OPA2PPS1>
extern volatile __bit                   OPA2PPS1            __at(0x13B9);	// @ (0x277 * 8 + 1)
#define                                 OPA2PPS1_bit        _BIT_ACCESS(OPA2ORPPS,1)
// OPA2ORPPS<OPA2PPS2>
extern volatile __bit                   OPA2PPS2            __at(0x13BA);	// @ (0x277 * 8 + 2)
#define                                 OPA2PPS2_bit        _BIT_ACCESS(OPA2ORPPS,2)
// OPA2ORPPS<OPA2PPS3>
extern volatile __bit                   OPA2PPS3            __at(0x13BB);	// @ (0x277 * 8 + 3)
#define                                 OPA2PPS3_bit        _BIT_ACCESS(OPA2ORPPS,3)
// OPA2ORPPS<OPA2PPS4>
extern volatile __bit                   OPA2PPS4            __at(0x13BC);	// @ (0x277 * 8 + 4)
#define                                 OPA2PPS4_bit        _BIT_ACCESS(OPA2ORPPS,4)
// OPA2ORPPS<OPA2PPS5>
extern volatile __bit                   OPA2PPS5            __at(0x13BD);	// @ (0x277 * 8 + 5)
#define                                 OPA2PPS5_bit        _BIT_ACCESS(OPA2ORPPS,5)
// OPA2CON3<OPA2PSS0>
extern volatile __bit                   OPA2PSS0            __at(0x950);	// @ (0x12A * 8 + 0)
#define                                 OPA2PSS0_bit        _BIT_ACCESS(OPA2CON3,0)
// OPA2CON3<OPA2PSS1>
extern volatile __bit                   OPA2PSS1            __at(0x951);	// @ (0x12A * 8 + 1)
#define                                 OPA2PSS1_bit        _BIT_ACCESS(OPA2CON3,1)
// OPA2CON4<OPA2PTRES>
extern volatile __bit                   OPA2PTRES           __at(0x95C);	// @ (0x12B * 8 + 4)
#define                                 OPA2PTRES_bit       _BIT_ACCESS(OPA2CON4,4)
// OPA2CON1<OPA2RESON>
extern volatile __bit                   OPA2RESON           __at(0x943);	// @ (0x128 * 8 + 3)
#define                                 OPA2RESON_bit       _BIT_ACCESS(OPA2CON1,3)
// OPA2CON0<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x93B);	// @ (0x127 * 8 + 3)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON0,3)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x57C);	// @ (0xAF * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// ACTCON<ORS>
extern volatile __bit                   ORS                 __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ORS_bit             _BIT_ACCESS(ACTCON,1)
// OPA1ORS<ORS5>
extern volatile __bit                   ORS5                __at(0x935);	// @ (0x126 * 8 + 5)
#define                                 ORS5_bit            _BIT_ACCESS(OPA1ORS,5)
// OPA1ORS<ORS6>
extern volatile __bit                   ORS6                __at(0x936);	// @ (0x126 * 8 + 6)
#define                                 ORS6_bit            _BIT_ACCESS(OPA1ORS,6)
// OPA1ORS<ORS7>
extern volatile __bit                   ORS7                __at(0x937);	// @ (0x126 * 8 + 7)
#define                                 ORS7_bit            _BIT_ACCESS(OPA1ORS,7)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x253A);	// @ (0x4A7 * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x2592);	// @ (0x4B2 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0x1A9D);	// @ (0x353 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0x1A9E);	// @ (0x353 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0x1A9F);	// @ (0x353 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0x1AA5);	// @ (0x354 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0x1AA6);	// @ (0x354 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0x1AA7);	// @ (0x354 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0x1AA8);	// @ (0x355 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0x1AA9);	// @ (0x355 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0x1AAA);	// @ (0x355 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0x1AAB);	// @ (0x355 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0x1AAC);	// @ (0x355 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0x1AAD);	// @ (0x355 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0x1AAE);	// @ (0x355 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0x1AAF);	// @ (0x355 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0x1A95);	// @ (0x352 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0x1A96);	// @ (0x352 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0x1A97);	// @ (0x352 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x1E24);	// @ (0x3C4 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x1E25);	// @ (0x3C4 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x1E26);	// @ (0x3C4 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x1E27);	// @ (0x3C4 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1528);	// @ (0x2A5 * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1538);	// @ (0x2A7 * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1548);	// @ (0x2A9 * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C1PIE<PCIE>
extern volatile __bit                   PCIE                __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PCIE_bit            _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PCIF>
extern volatile __bit                   PCIF                __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PCIF_bit            _BIT_ACCESS(I2C1PIR,2)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0x1FA1);	// @ (0x3F4 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// APMPERL<PER0>
extern volatile __bit                   PER0                __at(0xE18);	// @ (0x1C3 * 8 + 0)
#define                                 PER0_bit            _BIT_ACCESS(APMPERL,0)
// APMPERL<PER1>
extern volatile __bit                   PER1                __at(0xE19);	// @ (0x1C3 * 8 + 1)
#define                                 PER1_bit            _BIT_ACCESS(APMPERL,1)
// APMPERH<PER10>
extern volatile __bit                   PER10               __at(0xE22);	// @ (0x1C4 * 8 + 2)
#define                                 PER10_bit           _BIT_ACCESS(APMPERH,2)
// APMPERH<PER11>
extern volatile __bit                   PER11               __at(0xE23);	// @ (0x1C4 * 8 + 3)
#define                                 PER11_bit           _BIT_ACCESS(APMPERH,3)
// APMPERH<PER12>
extern volatile __bit                   PER12               __at(0xE24);	// @ (0x1C4 * 8 + 4)
#define                                 PER12_bit           _BIT_ACCESS(APMPERH,4)
// APMPERH<PER13>
extern volatile __bit                   PER13               __at(0xE25);	// @ (0x1C4 * 8 + 5)
#define                                 PER13_bit           _BIT_ACCESS(APMPERH,5)
// APMPERH<PER14>
extern volatile __bit                   PER14               __at(0xE26);	// @ (0x1C4 * 8 + 6)
#define                                 PER14_bit           _BIT_ACCESS(APMPERH,6)
// APMPERH<PER15>
extern volatile __bit                   PER15               __at(0xE27);	// @ (0x1C4 * 8 + 7)
#define                                 PER15_bit           _BIT_ACCESS(APMPERH,7)
// APMPERL<PER2>
extern volatile __bit                   PER2                __at(0xE1A);	// @ (0x1C3 * 8 + 2)
#define                                 PER2_bit            _BIT_ACCESS(APMPERL,2)
// APMPERL<PER3>
extern volatile __bit                   PER3                __at(0xE1B);	// @ (0x1C3 * 8 + 3)
#define                                 PER3_bit            _BIT_ACCESS(APMPERL,3)
// APMPERL<PER4>
extern volatile __bit                   PER4                __at(0xE1C);	// @ (0x1C3 * 8 + 4)
#define                                 PER4_bit            _BIT_ACCESS(APMPERL,4)
// APMPERL<PER5>
extern volatile __bit                   PER5                __at(0xE1D);	// @ (0x1C3 * 8 + 5)
#define                                 PER5_bit            _BIT_ACCESS(APMPERL,5)
// APMPERL<PER6>
extern volatile __bit                   PER6                __at(0xE1E);	// @ (0x1C3 * 8 + 6)
#define                                 PER6_bit            _BIT_ACCESS(APMPERL,6)
// APMPERL<PER7>
extern volatile __bit                   PER7                __at(0xE1F);	// @ (0x1C3 * 8 + 7)
#define                                 PER7_bit            _BIT_ACCESS(APMPERL,7)
// APMPERH<PER8>
extern volatile __bit                   PER8                __at(0xE20);	// @ (0x1C4 * 8 + 0)
#define                                 PER8_bit            _BIT_ACCESS(APMPERH,0)
// APMPERH<PER9>
extern volatile __bit                   PER9                __at(0xE21);	// @ (0x1C4 * 8 + 1)
#define                                 PER9_bit            _BIT_ACCESS(APMPERH,1)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2230);	// @ (0x446 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1AB8);	// @ (0x357 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1AB9);	// @ (0x357 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1ABA);	// @ (0x357 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1ABB);	// @ (0x357 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
